dataset_gen/CE_datasets/FPO_cylinder/Hole_Size/Design_Point_0/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
